---
kind: method
id: M:Autodesk.Revit.DB.Analysis.FieldValues.Dispose
source: html/3202859e-01d2-e42e-c2a6-cd83045d8210.htm
---
# Autodesk.Revit.DB.Analysis.FieldValues.Dispose Method

Releases all resources used by the FieldValues

## Syntax (C#)
```csharp
public void Dispose()
```